app/controllers/oauth_controller.rb

SELECT `users`.id FROM `users` WHERE (`users`.`facebook_id` = BINARY '1134513482') LIMIT 1
INSERT INTO `users` (`name`, `facebook_id`, `created_at`, `fb_page_id`, `fb_access_token`, `updated_at`, `email`) VALUES('Kim Ben', '1134513482', '2010-05-02 09:53:17', NULL, '111604162209107|2e65fe8ef314a431e5444df9-1134513482|VtpgFmKHQAQs1KDxuKiy8Xlh7tA.', '2010-05-02 09:53:17', 'tinupc@yahoo.com')
---
  def callback
    access_token = client.web_server.access_token(
      params[:code], :redirect_uri => oauth_callback_url
    )
    user_json = JSON.parse(access_token.get('/me'))
    user = User.find_by_facebook_id(user_json["id"])

    if user.blank?
      user = User.new(:name => user_json["name"], :email => user_json["email"], :facebook_id => user_json["id"], :fb_access_token => access_token.token)
      if user.save