app/controllers/users_controller.rb

  def update
    @user = current_user
    if @user.update_attributes params[:user]
---
UPDATE `users` SET `updated_at` = '2010-05-02 09:51:31', `fb_page_id` = '108352959205296' WHERE `id` = 1